{
	"name": "Ricardo Agustin Gonzalez",
	"email": "agus.devvv@gmail.com",
	"website": "www.vulcanis.com.ar",
	"github": "www.github.com/AgustinGonzalez1",
	"summary": "Desarrollador Full Stack con más de 3 años de experiencia en el desarrollo de aplicaciones web con el stack PERN. Especializado en la creación de interfaces fluidas con Tailwind CSS, además de la manipulación de APIs y despliegues automatizados. Enfocado en la mejora continua de la experiencia del usuario y la optimización del rendimiento en entornos ágiles.",
	"employment": [
		{
			"position": "Desarrollador Full Stack",
			"company": "By Derm",
			"dates": "Junio 2024 - noviembre 2024",
			"details": [
				"Desarrollo de aplicaciones web con stack PERN (PostgreSQL, Express.js, React.js, Node.js).",
				"Implementación de interfaces fluidas con Tailwind CSS y React.",
				"Optimización de la aplicación y colaboración con DevOps para despliegues y automatización."
			]
		},
		{
			"position": "Desarrollador Full Stack",
			"company": "Novigo Technology",
			"dates": "Noviembre 2024 - Presente",
			"details": [
				"Desarrollo de aplicaciones web con Vue (frontend) y Frappe (backend) para ERP y CRM.",
				"Implementación de funcionalidades personalizadas en Frappe, optimizando la gestión de datos empresariales.",
				"Colaboración con equipos de diseño e infraestructura para despliegues ágiles."
			]
		},
		{
			"position": "Profesor de Programacion Frontend",
			"company": "Play Code Latam",
			"dates": "Enero 2024 - Presente",
			"details": [
				"Imparto clases de desarrollo web centradas en HTML, CSS, JavaScript y TypeScript.",
				"Guío a estudiantes en proyectos con React, Tailwind CSS y Bootstrap 5, fomentando un aprendizaje práctico.",
				"Enseño mejores prácticas en UX/UI y desarrollo de interfaces responsivas."
			]
		}
	],
	"projects": [
		{
			"title": "Aplicacion Web con Stack PERN",
			"description": [
				"Desarrollo de una aplicación web completa utilizando PostgreSQL, Express.js, React.js y Node.js.",
				"Implementación de interfaces de usuario dinámicas con Tailwind CSS y React.",
				"Creación de APIs RESTful con Node.js y Express, integradas con bases de datos PostgreSQL mediante Sequelize."
			],
			"technologies": [
				"JavaScript",
				"TypeScript",
				"React",
				"Tailwind CSS",
				"Node.js",
				"Express",
				"PostgreSQL",
				"Sequelize",
				"GitHub Actions"
			]
		},
		{
			"title": "Automatizacion de Procesos y Despliegue con GitHub Actions",
			"description": [
				"Creación de flujos de trabajo automatizados para aplicaciones web.",
				"Colaboración con equipos DevOps para integrar prácticas de integración y entrega continua."
			],
			"technologies": ["AWS", "Node.js", "React", "GitHub Actions"]
		},
		{
			"title": "Dashboard de Datos con Enfoque en UX/UI",
			"description": [
				"Desarrollo de un dashboard interactivo para visualización de métricas clave.",
				"Implementación de prácticas avanzadas de UX/UI con Tailwind CSS y React, brindando diseños responsivos.",
				"Integración con APIs para mostrar datos actualizados en tiempo real."
			],
			"technologies": ["JavaScript", "React", "Tailwind CSS", "Node.js", "Express"]
		}
	],
	"skills": [
		"JavaScript, TypeScript, Python",
		"React, Next.js, Node.js, Express, Django",
		"PostgreSQL, SQL",
		"AWS, GitHub Actions, Google Maps API",
		"API RESTful, UX/UI, Tailwind CSS, Web Scraping, Automatizacion de Procesos, DevOps"
	]
}
